In [73]:
import pandas as pd
import numpy as np

Задание 1

In [74]:
a = {
    'author_id': [1, 2, 3],
    'author_name': ['Тургенев', 'Чехов', 'Островский']
}
authors = pd.DataFrame(a)
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [75]:
b = {
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий',  'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price': [450, 300, 350, 500, 450, 370, 290]
}
books = pd.DataFrame(b)
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [76]:
authors_price = books.merge(authors, how='outer')
authors_price

   author_id            book_title  price author_name
0          1           Отцы и дети    450    Тургенев
1          1                 Рудин    300    Тургенев
2          1     Дворянское гнездо    350    Тургенев
3          2      Толстый и тонкий    500       Чехов
4          2       Дама с собачкой    450       Чехов
5          3                 Гроза    370  Островский
6          3  Таланты и поклонники    290  Островский

Задание 3

In [77]:
top5 = authors_price.nlargest(5, "price")
top5

   author_id         book_title  price author_name
3          2   Толстый и тонкий    500       Чехов
0          1        Отцы и дети    450    Тургенев
4          2    Дама с собачкой    450       Чехов
5          3              Гроза    370  Островский
2          1  Дворянское гнездо    350    Тургенев

Задание 4

In [78]:
authors_stat = authors_price.groupby('author_name')
authors_stat["price"].min()

author_name
Островский    290
Тургенев      300
Чехов         450
Name: price, dtype: int64

ВАРИАНТ 1

In [79]:
authors_stat1 = authors_price.groupby('author_name').agg(min_price=('price', 'min'), max_price=('price', 'max'), mean_price=('price', 'mean'))
authors_stat1

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

ВАРИАНТ 2

In [80]:
authors_stat2 = authors_price.groupby('author_name')['price'].agg(min_price='min', max_price='max', mean_price='mean')
authors_stat2

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

ВАРИАНТ 3

In [81]:
authors_stat3 = authors_price.groupby('author_name')['price'].agg(['min', 'max', 'mean']) \
  .rename(columns={'min':'price_min', 'max':'price_max', 'mean':'price_mean'})
authors_stat3

             price_min  price_max  price_mean
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000